Revit 2027 API
NumericRevisionSettings Constructor
 Constructs a NumericRevisionSettings with a simple, default numbering sequence.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NumericRevisionSettings()
Public Sub New
public:
NumericRevisionSettings()
new : unit -> NumericRevisionSettings
Remarks
 Initializes startNumber to 1. The prefix and suffix strings are set to empty.
See Also
Reference
NumericRevisionSettings Class
NumericRevisionSettings Overload
Autodesk.Revit.DB Namespace